[
        {
        "title": "Animatrice fablab",
        "period": "July 2025 - Present",
        "company": "Mission Locale Le Havre Estuaire Littoral",
        "location": "Le Havre, Normandie",
        "description": [
            "As a facilitator at the <strong>Mission Locale Le Havre Estuaire Littoral</strong>, I am responsible for managing and animating the <strong>fablab</strong>.",
            "I guide users in the use of equipment such as <strong>3D printers</strong>, <strong>laser cutters</strong>, and others.",
            "I also conduct workshops on the three types of transition: <strong>digital</strong>, <strong>ecological</strong>, and <strong>energy</strong>.",
            "I ensure that safety rules are followed and that the equipment is well maintained.",
            "I collaborate with other facilitators, employees of the Mission Locale, as well as partners of the organization."
        ]
    },
    {
        "title": "Data Analyst (Internship)",
        "period": "November 2023 - December 2024",
        "company": "Caux Seine Agglo",
        "location": "Lillebonne, Normandie",
        "description": [
            "As a <strong>Data Analyst</strong>, I gathered data from sensors across the Caux Seine Agglo territory.",
            "Data was received via: Automatic <strong>SFTP</strong> drop, CURL, Manual upload.",
            "I developed a <strong>Python API</strong> to collect these feeds and store them in our <strong>PostgreSQL database</strong>.",
            "I cleaned the data to remove possible sensor errors or human interference.",
            "I created dashboards with ArcGIS to visualize and export the data on maps.",
            "Since the dashboards were used by both Caux Seine Agglo staff and external users (such as mayors), I regularly led <strong>meetings and gathered feedback to improve the tools</strong>.",
            "I <strong>wrote comprehensive documentation</strong> to help users adopt the app and enable new developers to maintain the code."
        ]
    },
    {
        "title": "FullStack developer (Internship)",
        "period": "April 2022 - August 2023",
        "company": "SeaFrigo",
        "location": "Le Havre, Normandie",
        "description": [
            "During this internship, I worked on a web application for the same company as my first internship.",
            "I developed a <strong>mobile app</strong> using <strong>Flutter</strong> to allow their clients to track shipments in real time using multiple <strong>APIs</strong>.",
            "I also developed and maintained web tools using <strong>JavaScript</strong>, <strong>PHP</strong>, and <strong>Python</strong> to help the company manage shipments and clients.",
            "I mainly worked using <strong>Jira's ticketing system</strong> to plan my work.",
            "Since my apps were intended to be used by many people, I <strong>wrote documentation</strong> for each app and for every change I made.",
            "I also learned <strong>Git</strong> and <strong>GitLab</strong> to version my code and collaborate with multiple developers on the same project."
        ]
    },
    {
        "title": "Help desk technician (Internship)",
        "period": "October 2021 - April 2022",
        "company": "SeaFrigo",
        "location": "Le Havre, Normandie",
        "description": [
            "During my first internship, I worked as a <strong>help desk technician</strong> for a worldwide import-export company.",
            "I had to manage the company's <strong>Database in MSSQL</strong> and fix bugs in their WMS.",
            "Most of my work involved helping employees with issues in our software by taking <strong>remote control</strong> of their computers or by fixing data directly in the database.",
            "I worked in real time on production data, so I had to be very <strong>careful and precise</strong> while resolving issues as quickly as possible to avoid downtime.",
            "Since most employees were not very tech-savvy, I explained how to use the tools and how to resolve issues on their own.",
            "Because much of the work was repetitive, I automated tasks using <strong>Python scripts</strong>, <strong>SQL stored procedures</strong>, and <strong>PHP scripts</strong> to save time and reduce human error."
        ]
    }
]
